I am seeing the same error

## Resource to be created

```
resource "google_iap_brand" "xxx_yyy_consent_screen" {
  application_title = "XxxYyyy"
  support_email     = "xxx.yyy@xample.com"
}
```

## Output 

```
$ tofu apply   

google_apikeys_key.drive_picker_api_key: Refreshing state... [id=projects/xxx-oauth-poc-2/locations/global/keys/drive-picker-api-key]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_iap_brand.xxx_yyy_consent_screen will be created
  + resource "google_iap_brand" "xxx_yyy_consent_screen" {
      + application_title = "XxxYyyy"
      + id                = (known after apply)
      + name              = (known after apply)
      + org_internal_only = (known after apply)
      + project           = "xxx-oauth-poc-2"
      + support_email     = "xxx.yyy@xample.com"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_iap_brand.xxx_yyy_consent_screen: Creating...
╷
│ Error: Error creating Brand: googleapi: Error 400: Request contains an invalid argument.
│ 
│   with google_iap_brand.xxx_yyy_consent_screen,
│   on main.tf line 27, in resource "google_iap_brand" "xxx_yyy_consent_screen":
│   27: resource "google_iap_brand" "xxx_yyy_consent_screen" {
│ 
╵
```

## Versions

```
OpenTofu v1.8.6
on linux_amd64
+ provider registry.opentofu.org/hashicorp/google v6.11.2
```